#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/flcdrg/terraform-azure-sql-db-replica/runs/run-VfeCJwqWy2eiFZGK

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
random_password.password: Refreshing state... [id=none]
data.azurerm_client_config.current: Refreshing...
data.azurerm_resource_group.rg: Refreshing...
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MDllM2ZjZC1lNzEzLTQ3MjItODA4Yi0yNTYxMjE0ZGQxNjI7b2JqZWN0SWQ9NzJlYWM3ZWMtMDI0My00NDljLWIxYTctMTU0MTZhMjRkYTBhO3N1YnNjcmlwdGlvbklkPWI0YjJlN2U5LTY2ZTctNDZiNS1hNTZiLWNjZTJiNTAwMTFkNDt0ZW5hbnRJZD01OWIwOTM0ZC00ZjM1LTRiZmYtYTJiNy1hNDUxZmU1ZjhiZDY=]
data.azurerm_resource_group.rg: Refresh complete after 1s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast]
azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast]
azurerm_mssql_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/firewallRules/AllowAzure]
azurerm_mssql_database.primary: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-australiaeast]
azurerm_mssql_database.secondary: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-secondary-australiaeast]
azurerm_mssql_server.mssql: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_mssql_database.primary will be updated in-place
  # (imported from "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-australiaeast")
  ~ resource "azurerm_mssql_database" "primary" {
        auto_pause_delay_in_minutes                                = 0
        collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
        create_mode                                                = "Default"
        elastic_pool_id                                            = null
        enclave_type                                               = null
        geo_backup_enabled                                         = true
        id                                                         = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-australiaeast"
        ledger_enabled                                             = false
        license_type                                               = null
        maintenance_configuration_name                             = "SQL_Default"
        max_size_gb                                                = 1
        min_capacity                                               = 0
        name                                                       = "sqldb-georeplica-australiaeast"
        read_replica_count                                         = 0
        read_scale                                                 = false
      + sample_name                                                = "AdventureWorksLT"
        secondary_type                                             = null
        server_id                                                  = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast"
        sku_name                                                   = "Basic"
        storage_account_type                                       = "Geo"
        tags                                                       = {}
        transparent_data_encryption_enabled                        = true
        transparent_data_encryption_key_automatic_rotation_enabled = false
        transparent_data_encryption_key_vault_key_id               = null
        zone_redundant                                             = false

        long_term_retention_policy {
            immutable_backups_enabled = false
            monthly_retention         = "PT0S"
            week_of_year              = 1
            weekly_retention          = "PT0S"
            yearly_retention          = "PT0S"
        }

        short_term_retention_policy {
            backup_interval_in_hours = 24
            retention_days           = 7
        }

        threat_detection_policy {
            disabled_alerts            = []
            email_account_admins       = "Disabled"
            email_addresses            = []
            retention_days             = 0
            state                      = "Disabled"
            storage_account_access_key = (sensitive value)
            storage_endpoint           = null
        }
    }

  # azurerm_mssql_database.secondary must be replaced
  # (imported from "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-secondary-australiaeast")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_mssql_database" "secondary" {
      ~ auto_pause_delay_in_minutes                                = 0 -> (known after apply)
        collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      ~ create_mode                                                = "Default" -> "Secondary" # forces replacement
      + creation_source_database_id                                = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-australiaeast" # forces replacement
        elastic_pool_id                                            = null
      + enclave_type                                               = (known after apply)
        geo_backup_enabled                                         = true
      ~ id                                                         = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/databases/sqldb-georeplica-secondary-australiaeast" -> (known after apply)
      ~ ledger_enabled                                             = false -> (known after apply)
      + license_type                                               = (known after apply)
      ~ maintenance_configuration_name                             = "SQL_Default" -> (known after apply)
      ~ max_size_gb                                                = 1 -> (known after apply)
      ~ min_capacity                                               = 0 -> (known after apply)
        name                                                       = "sqldb-georeplica-secondary-australiaeast"
      ~ read_replica_count                                         = 0 -> (known after apply)
      ~ read_scale                                                 = false -> (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      ~ secondary_type                                             = "Geo" -> (known after apply)
        server_id                                                  = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast"
        sku_name                                                   = "Basic"
        storage_account_type                                       = "Geo"
      - tags                                                       = {} -> null
        transparent_data_encryption_enabled                        = true
        transparent_data_encryption_key_automatic_rotation_enabled = false
        transparent_data_encryption_key_vault_key_id               = null
      ~ zone_redundant                                             = false -> (known after apply)

      ~ long_term_retention_policy (known after apply)
      - long_term_retention_policy {
          - immutable_backups_enabled = false -> null
          - monthly_retention         = "PT0S" -> null
          - week_of_year              = 1 -> null
          - weekly_retention          = "PT0S" -> null
          - yearly_retention          = "PT0S" -> null
        }

      ~ short_term_retention_policy (known after apply)
      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      ~ threat_detection_policy (known after apply)
      - threat_detection_policy {
          - disabled_alerts            = [] -> null
          - email_account_admins       = "Disabled" -> null
          - email_addresses            = [] -> null
          - retention_days             = 0 -> null
          - state                      = "Disabled" -> null
          - storage_account_access_key = (sensitive value) -> null
            storage_endpoint           = null
        }
    }

Plan: 2 to import, 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Waiting for cost estimate to complete...

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*